<?php
/*
"百钱买百鸡"问题
公鸡5文钱1只，母鸡3文钱1只，小鸡1文钱买三只，
现在用100文钱共买了100只鸡。
问：在这100只鸡中，公鸡、母鸡、小鸡各是多少只？（每种至少一只）


*/


for($i=1;$i<100/5;$i++){//公鸡
	for($j=1;$j<100/3;$j++){//母鸡
		for($k=1;$k<100;$k++){//小鸡
			if(($i+$j+$k==100) && (5*$i+3*$j+1/3*$k==100)){
				echo "公鸡有",$i," 母鸡有",$j," 小鸡有",$k,"<br/>";
			}
		}
	}
}

//优化版本
for($i=1;$i<20;$i++){//公鸡
	for($j=1;$j<=33;$j++){//母鸡
		$k=100-$i-$j;
		if(($i+$j+$k==100) && (5*$i+3*$j+1/3*$k==100)){
			echo "公鸡有",$i," 母鸡有",$j," 小鸡有",$k,"<br/>";
		}	
	}
}
?>